entropia/gpn17-badge/arduino/gpnbadge-2.3.0/boards.txt
##############################################################
singlerom.name=GPN Badge 2017 singlerom

singlerom.upload.tool=esptool
singlerom.upload.speed=460800
singlerom.upload.resetmethod=nodemcu
singlerom.upload.maximum_size=1044464
singlerom.upload.maximum_data_size=81920
singlerom.upload.wait_for_upload_port=true
singlerom.serial.disableDTR=true
singlerom.serial.disableRTS=true

singlerom.build.mcu=esp8266
singlerom.build.f_cpu=160000000L
singlerom.build.board=ESP8266_NODEMCU
singlerom.build.core=esp8266
singlerom.build.variant=nodemcu
singlerom.build.flash_mode=dio
singlerom.build.flash_size=4M
singlerom.build.flash_freq=80
singlerom.build.debug_port=
singlerom.build.debug_level=

singlerom.menu.CpuFrequency.160=160 MHz
singlerom.menu.CpuFrequency.160.build.f_cpu=160000000L
singlerom.menu.CpuFrequency.80=80 MHz
singlerom.menu.CpuFrequency.80.build.f_cpu=80000000L

singlerom.menu.UploadSpeed.921600=921600
singlerom.menu.UploadSpeed.921600.upload.speed=921600
singlerom.menu.UploadSpeed.115200=115200
singlerom.menu.UploadSpeed.115200.upload.speed=115200
singlerom.menu.UploadSpeed.9600=9600
singlerom.menu.UploadSpeed.9600.upload.speed=9600
singlerom.menu.UploadSpeed.57600=57600
singlerom.menu.UploadSpeed.57600.upload.speed=57600
singlerom.menu.UploadSpeed.256000.windows=256000
singlerom.menu.UploadSpeed.256000.upload.speed=256000
singlerom.menu.UploadSpeed.230400.linux=230400
singlerom.menu.UploadSpeed.230400.macosx=230400
singlerom.menu.UploadSpeed.230400.macosx=230400
singlerom.menu.UploadSpeed.230400.upload.speed=230400
singlerom.menu.UploadSpeed.460800.linux=460800
singlerom.menu.UploadSpeed.460800.macosx=460800
singlerom.menu.UploadSpeed.460800.upload.speed=460800
singlerom.menu.UploadSpeed.512000.windows=512000
singlerom.menu.UploadSpeed.512000.upload.speed=512000

singlerom.menu.FlashSize.4M3M=4M (3M SPIFFS) THIS DELETES ALL ROMS!
singlerom.menu.FlashSize.4M3M.build.flash_size=8M
singlerom.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
singlerom.menu.FlashSize.4M3M.build.spiffs_start=0x100000
singlerom.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
singlerom.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
singlerom.menu.FlashSize.4M3M.build.spiffs_pagesize=256



##############################################################
multirom.name=GPN Badge 2017 multirom

multirom.upload.tool=gpntool
multirom.upload.speed=460800
multirom.upload.resetmethod=nodemcu
multirom.upload.maximum_size=1044464
multirom.upload.maximum_data_size=81920
multirom.upload.wait_for_upload_port=true
multirom.serial.disableDTR=true
multirom.serial.disableRTS=true

multirom.build.mcu=esp8266
multirom.build.f_cpu=160000000L
multirom.build.board=ESP8266_NODEMCU
multirom.build.core=esp8266
multirom.build.variant=nodemcu
multirom.build.flash_mode=dio
multirom.build.flash_size=4M
multirom.build.flash_freq=80
multirom.build.debug_port=
multirom.build.debug_level=

multirom.menu.CpuFrequency.160=160 MHz
multirom.menu.CpuFrequency.160.build.f_cpu=160000000L
multirom.menu.CpuFrequency.80=80 MHz
multirom.menu.CpuFrequency.80.build.f_cpu=80000000L

multirom.menu.UploadSpeed.921600=921600
multirom.menu.UploadSpeed.921600.upload.speed=921600
multirom.menu.UploadSpeed.115200=115200
multirom.menu.UploadSpeed.115200.upload.speed=115200
multirom.menu.UploadSpeed.9600=9600
multirom.menu.UploadSpeed.9600.upload.speed=9600
multirom.menu.UploadSpeed.57600=57600
multirom.menu.UploadSpeed.57600.upload.speed=57600
multirom.menu.UploadSpeed.256000.windows=256000
multirom.menu.UploadSpeed.256000.upload.speed=256000
multirom.menu.UploadSpeed.230400.linux=230400
multirom.menu.UploadSpeed.230400.macosx=230400
multirom.menu.UploadSpeed.230400.macosx=230400
multirom.menu.UploadSpeed.230400.upload.speed=230400
multirom.menu.UploadSpeed.460800.linux=460800
multirom.menu.UploadSpeed.460800.macosx=460800
multirom.menu.UploadSpeed.460800.upload.speed=460800
multirom.menu.UploadSpeed.512000.windows=512000
multirom.menu.UploadSpeed.512000.upload.speed=512000

multirom.menu.FlashSize.rom0=Slot 0: 512kB (1M global SPIFFS) THIS DELETES THE ROM SELECTOR!
multirom.menu.FlashSize.rom0.build.flash_size=4M
multirom.menu.FlashSize.rom0.build.flash_ld=eagle.flash.512k0.mono.rboot.even.ld
multirom.menu.FlashSize.rom0.build.spiffs_start=0x300000
multirom.menu.FlashSize.rom0.build.spiffs_end=0x3FB000
multirom.menu.FlashSize.rom0.build.spiffs_blocksize=8192
multirom.menu.FlashSize.rom0.build.spiffs_pagesize=256
multirom.menu.FlashSize.rom0.upload.address=0x2000

multirom.menu.FlashSize.rom1=Slot 1: 512kB (1M global SPIFFS)
multirom.menu.FlashSize.rom1.build.flash_size=4M
multirom.menu.FlashSize.rom1.build.flash_ld=eagle.flash.512k0.mono.rboot.odd.ld
multirom.menu.FlashSize.rom1.build.spiffs_start=0x300000
multirom.menu.FlashSize.rom1.build.spiffs_end=0x3FB000
multirom.menu.FlashSize.rom1.build.spiffs_blocksize=8192
multirom.menu.FlashSize.rom1.build.spiffs_pagesize=256
multirom.menu.FlashSize.rom1.upload.address=0x82000

multirom.menu.FlashSize.rom2=Slot 2: 512kB (1M global SPIFFS)
multirom.menu.FlashSize.rom2.build.flash_size=4M
multirom.menu.FlashSize.rom2.build.flash_ld=eagle.flash.512k0.mono.rboot.even.ld
multirom.menu.FlashSize.rom2.build.spiffs_start=0x300000
multirom.menu.FlashSize.rom2.build.spiffs_end=0x3FB000
multirom.menu.FlashSize.rom2.build.spiffs_blocksize=8192
multirom.menu.FlashSize.rom2.build.spiffs_pagesize=256
multirom.menu.FlashSize.rom2.upload.address=0x102000

multirom.menu.FlashSize.rom3=Slot 3: 512kB (1M global SPIFFS)
multirom.menu.FlashSize.rom3.build.flash_size=4M
multirom.menu.FlashSize.rom3.build.flash_ld=eagle.flash.512k0.mono.rboot.odd.ld
multirom.menu.FlashSize.rom3.build.spiffs_start=0x300000
multirom.menu.FlashSize.rom3.build.spiffs_end=0x3FB000
multirom.menu.FlashSize.rom3.build.spiffs_blocksize=8192
multirom.menu.FlashSize.rom3.build.spiffs_pagesize=256
multirom.menu.FlashSize.rom3.upload.address=0x182000

multirom.menu.FlashSize.rom4=Slot 4: 512kB (1M global SPIFFS)
multirom.menu.FlashSize.rom4.build.flash_size=4M
multirom.menu.FlashSize.rom4.build.flash_ld=eagle.flash.512k0.mono.rboot.even.ld
multirom.menu.FlashSize.rom4.build.spiffs_start=0x300000
multirom.menu.FlashSize.rom4.build.spiffs_end=0x3FB000
multirom.menu.FlashSize.rom4.build.spiffs_blocksize=8192
multirom.menu.FlashSize.rom4.build.spiffs_pagesize=256
multirom.menu.FlashSize.rom4.upload.address=0x202000

multirom.menu.FlashSize.rom5=Slot 5: 512kB (1M global SPIFFS)
multirom.menu.FlashSize.rom5.build.flash_size=4M
multirom.menu.FlashSize.rom5.build.flash_ld=eagle.flash.512k0.mono.rboot.odd.ld
multirom.menu.FlashSize.rom5.build.spiffs_start=0x300000
multirom.menu.FlashSize.rom5.build.spiffs_end=0x3FB000
multirom.menu.FlashSize.rom5.build.spiffs_blocksize=8192
multirom.menu.FlashSize.rom5.build.spiffs_pagesize=256
multirom.menu.FlashSize.rom5.upload.address=0x282000




